<template>
    <Head title="اجاره نامه واحد تجاری"/>
    <div class="rb-rent-section">
        <div class="rb-info">
            <img :src="logo" alt="">
            <ul>
                <li>شماره:<strong>{{ transfer.contract_number }}</strong></li>
            </ul>
        </div>
        <div class="text-center">
            <h1>اجـــاره‌نــامــه</h1>
        </div>
        <h2>ماده 1- طرفین قرارداد</h2>
        <p class="rb-m" v-for="(owner,index) in transfer.owners" :key="index">
            1-1- اطلاعات موجر: خانم / آقای : <strong>{{ owner.user.name }}</strong> فرزند :
            <strong>{{ owner.user.father_name ?? dot }}</strong> کد ملی : <strong>{{
                owner.user.national_code ?? dot
            }}</strong>
            ساکن : <strong>{{ owner.user.address ?? dot + dot + dot }}</strong>
            تلفن : <strong>{{ owner.user.mobile ?? dot }}</strong> {{ owner.user.mobile2 ? 'و' : '' }}
            <strong>{{ owner.user.mobile2 }}</strong>
        </p>
        <p class="rb-m" v-for="(occupant,index) in transfer.occupants" :key="index">
            2-1- اطلاعات مستاجر: خانم / آقای : <strong>{{ occupant.user.name ?? dot }}</strong> فرزند :
            <strong>{{ occupant.user.father_name ?? dot }}</strong> کد ملی :
            <strong>{{ occupant.user.national_code ?? dot }}</strong> ساکن :
            <strong>{{ occupant.user.address ?? dot + dot + dot }}</strong>
            تلفن : <strong>{{ occupant.user.mobile ?? dot }}</strong> {{
                occupant.user.mobile2 ? 'و' : ''
            }}<strong>{{ occupant.user.mobile2 }}</strong>
        </p>
        <h2>ماده 2- موضوع قرارداد و مشخصات مورد اجاره</h2>
        <p class="rb-m">
            عبارت است از واگذاری منافع ششدانگ یک باب واحد تجاری شماره <strong>{{ transfer.unit.unit_number }}</strong>
            واقع در مجتمع مرکز خرید
            17شهریور با امتیاز برق
            به شماره بدنه کنتور <strong>{{ transfer.unit.meter_serial_number ?? dot }}</strong> و 1خط تلفن
            <strong>{{ transfer.unit.tel ?? dot }}</strong> و سایر منصوبات و
            مشاعات مربوطه که به رؤیت
            مستأجر/مستاجرین رسیده و مورد قبول قرار گرفته است و نامبرده از کم و کیف وضعیت پلاک مطلع میباشد.
        </p>
        <h2>ماده3- مدت اجاره</h2>
        <p class="rb-m"> مدت اجاره {{ transfer.duration ?? dot }} از تاریخ
            <strong>{{ transfer.rental_start_at.jalali ?? dot }}</strong> الی
            <strong>{{ transfer.rental_end_at.jalali ?? dot }}</strong> می
            باشد.</p>
        <h2>ماده4- اجاره‌ بهاء و نحوه پرداخت</h2>
        <p class="rb-m">1-4- میزان اجاره‌ بهاء از قرار ماهیانه مبلغ
            <strong>{{ transfer.rental_amount ? numberFormat(transfer.rental_amount) : dot }}</strong>
            <small>ریال</small>
            مقرر گردید که قرار شد ماهانه به شماره کارت {{ transfer.card_number }} واریز گردد.
        </p>
        <p class="rb-m">2-4- مبلغ <strong>{{
                transfer.mortgage_amount ? numberFormat(transfer.mortgage_amount) : dot
            }}</strong> <small>ریال</small> از طرف مستأجر/مستاجرین به ‌عنوان
            قرض‌الحسنه طی چک
            و واریزی(ضمیمه شده قرارداد) به موجر پرداخت گردید.</p>
        <h2>ماده5- تسلیم مورد اجاره</h2>
        <p class="rb-m">
            1-5-موجر در تاریخ <strong>{{ transfer.doing_at.jalali ?? dot }}</strong> مورد اجاره را با تمام توابع و
            ملحقات و منضمات آن همراه با یک
            خط تلفن ثابت جهت
            استیفاء به مستأجر/مستاجرین تسلیم نمود. سقف و نور پردازی واحد مذکور متعلق به موجر میباشد.
        </p>
        <p class="rb-m">
            مستأجر از روز اول شروع قرارداد مکلف است پس از تحویل محل آن را تجهیز و تکمیل نموده و امکان عرضه کالا را به
            مشتریان فراهم نماید. چنانچه ظرف مدت یک هفته از تاریخ قرارداد شروع به کار ننماید ، موجر یا مدیریت بازار حق
            فسخ قرارداد را داشته و آن را فسخ و جهت استفاده به غیر واگذار نماید و خسارات وارده را به تشخیص خود از محل
            تضمین برداشت می نماید و نظر موجر و مدیریت بازار در این مورد قطعی و لازم الرعایه می باشد.
        </p>
        <p class="rb-m">
            2-5- این قرارداد در راستای قرارداد صلح سرقفلی شرکت نگین شاهنامه با موجر به شماره
            <strong>{{ transfer.unit.unit_number ?? dot }}</strong> تنظیم
            شده وکلیه شرایط و مطالب مندرج در آن برای مستاجر لازم الاتباع میباشد و اعتبار و صحت این قرارداد منوط به تنفیذ
            و تایید شرکت نگین شاهنامه میباشد.
        </p>
        <h2>ماده6- شرایط و آثار قرارداد</h2>
        <p class="rb-m">
            1-6- مورد اجاره صرفا فقط جهت فروشندگی <strong>{{ transfer.unit.position.label }}</strong> می‌باشد و مستأجر
            نمی‌تواند برخلاف مشاغل
            آن طبقه استفاده نماید.
        </p>
        <p class="rb-m">کاربری مشاغل در طبقات مرکز خرید 17شهریور و به شرح ذیل میباشد:</p>
        <ul>
            <li><strong>منهای یک:</strong> مانتو و روسری و حجاب</li>
            <li><strong>همکف پایین:</strong> پوشاک مردانه یا زنانه به جزء مانتو ، روسری ، حجاب و لباس زیر</li>
            <li><strong>همکف بالا:</strong> پوشاک مردانه یا زنانه به جزء مانتو ، روسری ، حجاب و لباس زیر</li>
            <li><strong>مثبت یک:</strong> زعفران ، سوغات ، کالای خواب ، پوشاک مردانه یا زنانه و مانتو به جزء روسری و
                حجاب و لباس زیر
            </li>
            <li><strong>مثبت دو:</strong> کیف و کفش ، آرایشی و بهداشتی ، عطر و ادکلن ، لباس زیر مردانه و زنانه ، ساعت ،
                بدلیجات و غیره
            </li>
            <li><strong>مثبت سه:</strong> پوشاک بچه گانه ، کیف و کفش بچه گانه ، سیسمونی کودک و اسباب بازی</li>
        </ul>
        <p class="rb-m">
            2-6- مستاجر بایستی شخصاً از مورد اجاره استفاده کند و حق انتقال به غیر به هیچ صورت اعم از مباشرت ، وکالت ،
            نمایندگی ، جزعاً و کلاً ندارد.
        </p>
        <p class="rb-m">
            3-6- درصورتی‌که مستأجر در پرداخت اجاره‌ بهاء بیش از یک ماه تأخیر نماید مکلف است علاوه بر پرداخت اصل بدهی ،
            تا زمان پرداخت آن روزانه مبلغ یک میلیون ریال به عنوان وجه ‌التزام ناشی از تاخیر در تادیه بدهی به موجر پرداخت
            نماید و علاوه بر این موجر حق فسخ قرارداد را نیز دارد.
        </p>
        <p class="rb-m">
            4-6- پرداخت هزینه‌های مصرفی برق/ تلفن/ شارژ و غیره بر عهده مستأجر است و چنانچه به هر دلیل این بدهی‌ها را
            پرداخت ننماید موجر میتواند مبالغ فوق را از قرض‌الحسنه دریافتی کسر و پرداخت نماید.
        </p>
        <p class="rb-m">
            5-6- جهت تضمین پرداخت به موقع اجارات ، شارژ ، هزینه های جاری ، مشترکات و بدهی های دولتی مربوطه مستاجر و
            خسارات وارده به عین مستاجره در زمان تخلیه ، چک/سفته شماره <strong>{{ transfer.check_number ?? dot }}</strong>
            عهده بانک <strong>{{ transfer.bank ?? dot }}</strong> از جاری
            شماره <strong>{{ transfer.current_account ?? dot }}</strong> به مبلغ
            <strong>{{ numberFormat(transfer.warranty_amount) ?? dot }}</strong> <small>ریال</small> صادر و
            تحویل موجر گردید و موجر حق وصول مطالبات خود از محل چک فوق و حق تهاتر از محل وجه قرض الحسنه را دارد در پایان
            مدت چنانچه حساب های فی مابین تسویه گردید چک فوق عینا به مستاجر عودت خواهد شد.
        </p>
        <div class="rb-signature">
            <span>نام و نام خانوادگی و امضای موجر</span>
            <span>نام و نام خانوادگی و امضای مستاجر</span>
        </div>
        <div class="rb-break"></div>
        <p class="rb-m">
            6-6- مالیات مستغلات ، تعمیرات اساسی با موجر و مالیات بردرآمد و مشاغل و حق بیمه ناشی از کارکرد پرسنل شاغل در
            واحد تجاری و اخذ گواهی ماده 37 قانون تامین اجتماعی و تعمیرات جزئی و عوارض صنفی شهرداری بر عهده مستأجر است.
        </p>
        <p class="rb-m">
            تبصره: اخذ گواهی عدم بدهی واحد تجاری در پایان این قرارداد از سازمان تامین اجتماعی متضامناً برعهده موجر و
            مستاجر به صورت یکسان می باشد و در صورت عدم پرداخت حقوق قانونی و مالی آن سازمان در دوره قرارداد موجر و مستاجر
            می بایست نسبت به پرداخت و رفع تعهد اقدام نمایند.
        </p>
        <p class="rb-m">
            7-6- هیچ‌گونه وجه یا مالی به‌عنوان سرقفلی ، حق کسب و پیشه یا تجارت و نظایر آن به هیچ عنوان از سوی مستأجر به
            موجر پرداخت نگردیده است.
        </p>
        <p class="rb-m">
            8-6- مستأجر مکلف است در زمان تخلیه مورد اجاره را به همان وضعی که تحویل گرفته به موجر تحویل دهد. در صورت حدوث
            خسارت نسبت به‌عین مستاجره، مستأجر متعهد به جبران خسارت وارده خواهد بود.
        </p>
        <p class="rb-m">
            9-6- طبق توافق صورت گرفته ، به میزان یک ماه اجاره پرداختی مندرج در بند 4-1 این قرارداد ، تحت عنوان حق
            مالکانه اجاره ، می بایست از طرف موجر/مستاجر چک بنام شرکت نگین شاهنامه صادر یا واریزی به حساب این شرکت انجام
            شود.
        </p>
        <h2>ماده7- فسخ قرارداد</h2>
        <p class="rb-m">
            1‌-7- مستاجر مكلف است نسبت به رعايت قواعد و مقررات بازار اقدام نمايد و همچنين نظم بازار را به صورت موكد
            رعايت كند، بنابراين مستاجر و افراد تحت نظارت وي، تحت هيچ‌عنوان حق درگيري يا ايجاد اغتشاش در مجموعه را
            ندارند.
        </p>
        <p class="rb-m">
            2-7- در صورتی که مستاجر به هر کدام از تعهدات خود در این قرارداد عمل ننماید، موجر حق فسخ قرارداد و تخلیه واحد
            را خواهد داشت.
        </p>
        <p class="rb-m">
            3-7-مستاجر مكلف است مورد اجاره را پس از انقضاء مدت اجاره، یا فسخ بدون هیچ عذر و بهانه‌ای تخلیه و مطابق وضعیت
            روز اول به موجر تحويل دهد؛ در صورت عدم تخلیه و تحویل محل به هر دلیل و یا عدم تمدید اجاره، ضمن اعمال قانون
            روابط موجر و مستاجر مصوبه سال 1376 و آیین‌نامه‌های مربوطه و اقدام جهت اخذ اجرت‌المثل، همزمان با اتمام مدت
            اجاره، به تقاضای موجر صرفاً با ارسال اظهارنامه ، بدون مراجعه به مراجع قضایی، برق واحد تا مشخص شدن تکلیف
            نامبردگان قطع خواهد شد و چنانچه بعد از گذشت یک هفته تخلیه نشد موجر حق بازگشایی قفل و تخلیه مغازه و واگذاری
            به غیر را در حضور دو شاهد دارد.
        </p>
        <h2>ماده8</h2>
        <p class="rb-m">
            آدرس قانونی طرفین همان است که در ماده یک (1) قرارداد قید و یا در سامانه ثنا ثبت شده است ، در صورت
            تغییر نشانی و شماره تلفن ، طرفین مکلفند حداکثر ظرف مدت پنج روز آدرس جدید را به صورت کتبی به طرف مقابل و دفتر
            بازار ابلاغ نمایند و مادامي که نشانی جدید اعلام نگردیده ، همان محل سابق اقامتگاه قانونی طرفین می‌باشد و
            ارسال هرگونه مکاتبات اعم از قضایی و غیرقضایی ، اظهارنامه ، اوراق مربوط به داوری و رای داور به طور کلی کلیه
            اوراق مربوط به این قرارداد، به همان نشانی قبلی، ابلاغ صحیح خواهد بود.
        </p>
        <h2>ماده9</h2>
        <p class="rb-m">کلیه خیارات ولو خیار غبن به ‌استثناء تدلیس از طرفین سلب و ساقط گردید.</p>
        <h2>ماده10</h2>
        <p class="rb-m">
            این قرارداد در سایر موارد تابع مقررات قانون مدنی و قانون روابط موجر و مستأجر مصوب سال 1376 خواهد بود
            و به استناد ماده 2 قانون اخير، شهود با مشخصات زیر این قرارداد را امضاء و گواهی می‌نمایند.
        </p>
        <h2>ماده11</h2>
        <p class="rb-m">
            موجر و مستاجر متعهد شدند و توافق نمودند که شرکت نگین شاهنامه مجاز خواهد بود در صورت عدم پرداخت شارژ
            بازار یا مالکانه اجاره یا اجاره سرقفلی(اجاره‌بها) بدون اطلاع قبلی و بدون مراجعه به مراجع قضایی، تا زمان
            پرداخت بدهی، نسبت به قطع برق واحد اقدام نماید و طرفین حق هیچ اعتراض و یا ادعایی در این خصوص را ندارند.
        </p>
        <h2>ماده12</h2>
        <p class="rb-m">
            این قرارداد در تاریخ<strong>{{ transfer.doing_at.jalali }}</strong> بابت پلاک
            <strong>{{ transfer.unit.unit_number }}</strong> در دفتر بازار به
            نشانی: مشهد؛ میدان 17 شهریور در دو
            نسخه بین طرفین تنظیم و مبادله گردید، ضمناً یک نسخه جهت بایگانی در دفتر بازار نیز تهیه و به امضای طرفین رسید.
        </p>
        <strong>توضیحات:</strong>
        <p class="rb-m">
            * موجر اقرار می‌نماید که هیچ شخص دیگری حقی در مورد اجاره ندارد و همچنین تنظیم‌کننده و ثبت‌کننده این قرارداد
            هیچ مسئولیتی در خصوص صحت گفتار طرفین و انجام تعهدات خارج قرارداد طرفین ندارد.
        </p>
        <p class="rb-m">
            * موجر با علم به اینکه تنظیم اجاره‌نامه در دفتر بازار به‌منزله رضایت شرکت نگین شاهنامه و دریافت حق و حقوقات
            خود نمی‌باشد، این اجاره‌نامه را امضاء نموده است.
        </p>
        <p>
            * پس از اتمام مدت اجاره موجر مکلف به معرفی مستاجر جدید بوده چنانچه بیش از یک هفته بگذرد و مستاجری معرفی
            نگردد جهت پیشگیری از حوادث احتمالی برق واحد تا اطلاع ثانوی و معرفی مستاجر جدید قطع میگردد.
        </p>
        <div class="rb-signature">
            <span>نام و نام خانوادگی و امضای شاهد اول</span>
            <span>نام و نام خانوادگی و امضای شاهد دوم</span>
        </div>
        <br>
        <div class="rb-signature">
            <span>نام و نام خانوادگی و امضای موجر</span>
            <span>نام و نام خانوادگی و امضای مستاجر</span>
        </div>
    </div>
</template>
<script>
import logoImage from '/resources/img/logo-print.png';
import {Head, usePage} from "@inertiajs/vue3";
import {nextTick, onMounted, ref} from "vue";
import {numberFormat} from "@/utils/helpers.js";

export default {
    methods: {numberFormat},
    components: {
        Head
    },
    setup() {
        const logo = logoImage;
        const page = usePage();
        const transfer = page.props.transfer.data;
        onMounted(() => {
            nextTick(() => {
                setTimeout(() => {
                    window.print();
                }, 2000);
            });
        });
        console.log(transfer)

        return {
            logo,
            transfer,
            dot: ref('..........')
        };
    }
};
</script>
<style>
@import '/resources/css/app.css';

.rb-rent-section {
    width: 100%;
    max-width: 1190px;
    margin: 0 auto;
    font-size: .75rem;
    text-align: justify;
}

.rb-rent-section .rb-m {
    margin: 0;
}

.rb-rent-section .rb-info {
    display: flex;
    align-items: center;
    justify-content: space-between;
    gap: 15px;
    font-size: .90rem;
}

.rb-rent-section .rb-info img {
    max-width: 100px;
}

.rb-rent-section .rb-info ul li {
    width: 100%;
    display: inline-block;
    text-align: left;
}

.rb-rent-section h1 {
    margin: 0;
    font-family: 'Estedad-Black';
    font-size: 1rem;
}

.rb-rent-section h2 {
    margin: 2.5px 0;
    font-family: 'Estedad-Black';
    font-size: .90rem;
}

.rb-rent-section p {
    line-height: 1.5;
}

.rb-rent-section ul {
    margin: 0 0 10px;
}

.rb-rent-section ul li {
    width: 100%;
    display: inline-block;
}

.rb-rent-section .rb-signature {
    display: flex;
    justify-content: space-between;
    gap: 15px;
    margin: 30px 0;
    padding: 0 90px;
}

.rb-rent-section .rb-break {
    height: 0;
    visibility: hidden;
    page-break-after: always;
}

</style>
